Autodesk.Revit.DB.CloudPath.#ctor(System.String,System.Guid,System.Guid)
Constructs a CloudPath which represents a specified central model
in a specified cloud project.
region:
The region of the cloud project which contains the model.
projectId:
The GUID of the cloud project which contains the model.
modelId:
The GUID of the cloud .rvt model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.CloudPath.#ctor(System.String,System.Guid,System.String,System.Guid,System.String)
Constructs a CloudPath which represents a specified central model
in a specified cloud project.
region:
The region of the cloud project which contains the model.
projectId:
The GUID of the cloud project which contains the model.
projectName:
The name of the cloud project which contains the model.
modelId:
The GUID of the cloud .rvt model.
modelName:
The name of the cloud .rvt model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019